---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudLength
source: html/cd204685-97ac-d9fe-ec7f-1f7178e4a69f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemShearstudLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemShearstudLength { get; }
```